Autodesk.Revit.DB.ExternalResourceServerExtensions.GetCADLinkOperations
Gets the specific methods supported by external resource CAD Links.
Returns:
The specific methods supported by external resource CAD Links.
Since:
2015

Autodesk.Revit.DB.ExternalResourceServerExtensions.GetRevitLinkOperations
Gets the specific methods supported by the external resource of Revit Links.
Returns:
The specific methods supported by the external resource of Revit Links.
Since:
2015

Autodesk.Revit.DB.ExternalResourceServerExtensions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceServerExtensions
An object that contains overrides for external resource-specific methods.
Remarks:
This class permits assignment of some specific operations related to a type of
external resource, such as what to do when "Open (and Unload)" happens, or when
"Shared Coordinates update" happens for Revit or CAD links.
There is no feedback to the UI server for ExternalResourceServerExtensions.
Revit will use standard, common message dialogs to handle any error conditions.
Since:
2015